TakeshiShiode/sample_cq_interface2023/qemu-6.0.0/include/hw/timer/rx62t_keytest.h


#ifndef HW_RENESAS_KEYTEST_H
#define HW_RENESAS_KEYTEST_H

#include "hw/sysbus.h"

//-----------------------------------------------------------------------------------
//! @name QEMU region
//@{
#define TYPE_RENESAS_KEYTEST "rx62t_keytest"
typedef struct RKEYTESTState RKEYTESTState;
DECLARE_INSTANCE_CHECKER(RKEYTESTState, RKEYTEST,
                         TYPE_RENESAS_KEYTEST)
                         
typedef struct RKEYTESTState{
    SysBusDevice parent_obj;
    MemoryRegion mmio;
    
    // teststate
    uint8_t    teststate;
    //test
    uint8_t    testkey;
    uint8_t     flush_on;
    uint8_t		dummy;
    uint8_t		sentence[256];

    
    QEMUTimer timer;
    
} RKEYTESTState;
//@}

#define TESTKEY_SIZE (0x200)
#define TESTSTATE (0x00)
#define TESTKEY (0x01)
#define FLUSH_ON (0x02)
#define	SENTENCE_BUF0		(0x004)
#define	SENTENCE_BUF1       (0x005)
#define	SENTENCE_BUF2       (0x006)
#define	SENTENCE_BUF3       (0x007)
#define	SENTENCE_BUF4       (0x008)
#define	SENTENCE_BUF5       (0x009)
#define	SENTENCE_BUF6       (0x00A)
#define	SENTENCE_BUF7       (0x00B)
#define	SENTENCE_BUF8       (0x00C)
#define	SENTENCE_BUF9       (0x00D)
#define	SENTENCE_BUF10      (0x00E)
#define	SENTENCE_BUF11      (0x00F)
#define	SENTENCE_BUF12      (0x010)
#define	SENTENCE_BUF13      (0x011)
#define	SENTENCE_BUF14      (0x012)
#define	SENTENCE_BUF15      (0x013)
#define	SENTENCE_BUF16      (0x014)
#define	SENTENCE_BUF17      (0x015)
#define	SENTENCE_BUF18      (0x016)
#define	SENTENCE_BUF19      (0x017)
#define	SENTENCE_BUF20      (0x018)
#define	SENTENCE_BUF21      (0x019)
#define	SENTENCE_BUF22      (0x01A)
#define	SENTENCE_BUF23      (0x01B)
#define	SENTENCE_BUF24      (0x01C)
#define	SENTENCE_BUF25      (0x01D)
#define	SENTENCE_BUF26      (0x01E)
#define	SENTENCE_BUF27      (0x01F)
#define	SENTENCE_BUF28      (0x020)
#define	SENTENCE_BUF29      (0x021)
#define	SENTENCE_BUF30      (0x022)
#define	SENTENCE_BUF31      (0x023)
#define	SENTENCE_BUF32      (0x024)
#define	SENTENCE_BUF33      (0x025)
#define	SENTENCE_BUF34      (0x026)
#define	SENTENCE_BUF35      (0x027)
#define	SENTENCE_BUF36      (0x028)
#define	SENTENCE_BUF37      (0x029)
#define	SENTENCE_BUF38      (0x02A)
#define	SENTENCE_BUF39      (0x02B)
#define	SENTENCE_BUF40      (0x02C)
#define	SENTENCE_BUF41      (0x02D)
#define	SENTENCE_BUF42      (0x02E)
#define	SENTENCE_BUF43      (0x02F)
#define	SENTENCE_BUF44      (0x030)
#define	SENTENCE_BUF45      (0x031)
#define	SENTENCE_BUF46      (0x032)
#define	SENTENCE_BUF47      (0x033)
#define	SENTENCE_BUF48      (0x034)
#define	SENTENCE_BUF49      (0x035)
#define	SENTENCE_BUF50      (0x036)
#define	SENTENCE_BUF51      (0x037)
#define	SENTENCE_BUF52      (0x038)
#define	SENTENCE_BUF53      (0x039)
#define	SENTENCE_BUF54      (0x03A)
#define	SENTENCE_BUF55      (0x03B)
#define	SENTENCE_BUF56      (0x03C)
#define	SENTENCE_BUF57      (0x03D)
#define	SENTENCE_BUF58      (0x03E)
#define	SENTENCE_BUF59      (0x03F)
#define	SENTENCE_BUF60      (0x040)
#define	SENTENCE_BUF61      (0x041)
#define	SENTENCE_BUF62      (0x042)
#define	SENTENCE_BUF63      (0x043)
#define	SENTENCE_BUF64      (0x044)
#define	SENTENCE_BUF65      (0x045)
#define	SENTENCE_BUF66      (0x046)
#define	SENTENCE_BUF67      (0x047)
#define	SENTENCE_BUF68      (0x048)
#define	SENTENCE_BUF69      (0x049)
#define	SENTENCE_BUF70      (0x04A)
#define	SENTENCE_BUF71      (0x04B)
#define	SENTENCE_BUF72      (0x04C)
#define	SENTENCE_BUF73      (0x04D)
#define	SENTENCE_BUF74      (0x04E)
#define	SENTENCE_BUF75      (0x04F)
#define	SENTENCE_BUF76      (0x050)
#define	SENTENCE_BUF77      (0x051)
#define	SENTENCE_BUF78      (0x052)
#define	SENTENCE_BUF79      (0x053)
#define	SENTENCE_BUF80      (0x054)
#define	SENTENCE_BUF81      (0x055)
#define	SENTENCE_BUF82      (0x056)
#define	SENTENCE_BUF83      (0x057)
#define	SENTENCE_BUF84      (0x058)
#define	SENTENCE_BUF85      (0x059)
#define	SENTENCE_BUF86      (0x05A)
#define	SENTENCE_BUF87      (0x05B)
#define	SENTENCE_BUF88      (0x05C)
#define	SENTENCE_BUF89      (0x05D)
#define	SENTENCE_BUF90      (0x05E)
#define	SENTENCE_BUF91      (0x05F)
#define	SENTENCE_BUF92      (0x060)
#define	SENTENCE_BUF93      (0x061)
#define	SENTENCE_BUF94      (0x062)
#define	SENTENCE_BUF95      (0x063)
#define	SENTENCE_BUF96      (0x064)
#define	SENTENCE_BUF97      (0x065)
#define	SENTENCE_BUF98      (0x066)
#define	SENTENCE_BUF99      (0x067)
#define	SENTENCE_BUF100     (0x068)
#define	SENTENCE_BUF101     (0x069)
#define	SENTENCE_BUF102     (0x06A)
#define	SENTENCE_BUF103     (0x06B)
#define	SENTENCE_BUF104     (0x06C)
#define	SENTENCE_BUF105     (0x06D)
#define	SENTENCE_BUF106     (0x06E)
#define	SENTENCE_BUF107     (0x06F)
#define	SENTENCE_BUF108     (0x070)
#define	SENTENCE_BUF109     (0x071)
#define	SENTENCE_BUF110     (0x072)
#define	SENTENCE_BUF111     (0x073)
#define	SENTENCE_BUF112     (0x074)
#define	SENTENCE_BUF113     (0x075)
#define	SENTENCE_BUF114     (0x076)
#define	SENTENCE_BUF115     (0x077)
#define	SENTENCE_BUF116     (0x078)
#define	SENTENCE_BUF117     (0x079)
#define	SENTENCE_BUF118     (0x07A)
#define	SENTENCE_BUF119     (0x07B)
#define	SENTENCE_BUF120     (0x07C)
#define	SENTENCE_BUF121     (0x07D)
#define	SENTENCE_BUF122     (0x07E)
#define	SENTENCE_BUF123     (0x07F)
#define	SENTENCE_BUF124     (0x080)
#define	SENTENCE_BUF125     (0x081)
#define	SENTENCE_BUF126     (0x082)
#define	SENTENCE_BUF127     (0x083)
#define	SENTENCE_BUF128     (0x084)
#define	SENTENCE_BUF129     (0x085)
#define	SENTENCE_BUF130     (0x086)
#define	SENTENCE_BUF131     (0x087)
#define	SENTENCE_BUF132     (0x088)
#define	SENTENCE_BUF133     (0x089)
#define	SENTENCE_BUF134     (0x08A)
#define	SENTENCE_BUF135     (0x08B)
#define	SENTENCE_BUF136     (0x08C)
#define	SENTENCE_BUF137     (0x08D)
#define	SENTENCE_BUF138     (0x08E)
#define	SENTENCE_BUF139     (0x08F)
#define	SENTENCE_BUF140     (0x090)
#define	SENTENCE_BUF141     (0x091)
#define	SENTENCE_BUF142     (0x092)
#define	SENTENCE_BUF143     (0x093)
#define	SENTENCE_BUF144     (0x094)
#define	SENTENCE_BUF145     (0x095)
#define	SENTENCE_BUF146     (0x096)
#define	SENTENCE_BUF147     (0x097)
#define	SENTENCE_BUF148     (0x098)
#define	SENTENCE_BUF149     (0x099)
#define	SENTENCE_BUF150     (0x09A)
#define	SENTENCE_BUF151     (0x09B)
#define	SENTENCE_BUF152     (0x09C)
#define	SENTENCE_BUF153     (0x09D)
#define	SENTENCE_BUF154     (0x09E)
#define	SENTENCE_BUF155     (0x09F)
#define	SENTENCE_BUF156     (0x0A0)
#define	SENTENCE_BUF157     (0x0A1)
#define	SENTENCE_BUF158     (0x0A2)
#define	SENTENCE_BUF159     (0x0A3)
#define	SENTENCE_BUF160     (0x0A4)
#define	SENTENCE_BUF161     (0x0A5)
#define	SENTENCE_BUF162     (0x0A6)
#define	SENTENCE_BUF163     (0x0A7)
#define	SENTENCE_BUF164     (0x0A8)
#define	SENTENCE_BUF165     (0x0A9)
#define	SENTENCE_BUF166     (0x0AA)
#define	SENTENCE_BUF167     (0x0AB)
#define	SENTENCE_BUF168     (0x0AC)
#define	SENTENCE_BUF169     (0x0AD)
#define	SENTENCE_BUF170     (0x0AE)
#define	SENTENCE_BUF171     (0x0AF)
#define	SENTENCE_BUF172     (0x0B0)
#define	SENTENCE_BUF173     (0x0B1)
#define	SENTENCE_BUF174     (0x0B2)
#define	SENTENCE_BUF175     (0x0B3)
#define	SENTENCE_BUF176     (0x0B4)
#define	SENTENCE_BUF177     (0x0B5)
#define	SENTENCE_BUF178     (0x0B6)
#define	SENTENCE_BUF179     (0x0B7)
#define	SENTENCE_BUF180     (0x0B8)
#define	SENTENCE_BUF181     (0x0B9)
#define	SENTENCE_BUF182     (0x0BA)
#define	SENTENCE_BUF183     (0x0BB)
#define	SENTENCE_BUF184     (0x0BC)
#define	SENTENCE_BUF185     (0x0BD)
#define	SENTENCE_BUF186     (0x0BE)
#define	SENTENCE_BUF187     (0x0BF)
#define	SENTENCE_BUF188     (0x0C0)
#define	SENTENCE_BUF189     (0x0C1)
#define	SENTENCE_BUF190     (0x0C2)
#define	SENTENCE_BUF191     (0x0C3)
#define	SENTENCE_BUF192     (0x0C4)
#define	SENTENCE_BUF193     (0x0C5)
#define	SENTENCE_BUF194     (0x0C6)
#define	SENTENCE_BUF195     (0x0C7)
#define	SENTENCE_BUF196     (0x0C8)
#define	SENTENCE_BUF197     (0x0C9)
#define	SENTENCE_BUF198     (0x0CA)
#define	SENTENCE_BUF199     (0x0CB)
#define	SENTENCE_BUF200     (0x0CC)
#define	SENTENCE_BUF201     (0x0CD)
#define	SENTENCE_BUF202     (0x0CE)
#define	SENTENCE_BUF203     (0x0CF)
#define	SENTENCE_BUF204     (0x0D0)
#define	SENTENCE_BUF205     (0x0D1)
#define	SENTENCE_BUF206     (0x0D2)
#define	SENTENCE_BUF207     (0x0D3)
#define	SENTENCE_BUF208     (0x0D4)
#define	SENTENCE_BUF209     (0x0D5)
#define	SENTENCE_BUF210     (0x0D6)
#define	SENTENCE_BUF211     (0x0D7)
#define	SENTENCE_BUF212     (0x0D8)
#define	SENTENCE_BUF213     (0x0D9)
#define	SENTENCE_BUF214     (0x0DA)
#define	SENTENCE_BUF215     (0x0DB)
#define	SENTENCE_BUF216     (0x0DC)
#define	SENTENCE_BUF217     (0x0DD)
#define	SENTENCE_BUF218     (0x0DE)
#define	SENTENCE_BUF219     (0x0DF)
#define	SENTENCE_BUF220     (0x0E0)
#define	SENTENCE_BUF221     (0x0E1)
#define	SENTENCE_BUF222     (0x0E2)
#define	SENTENCE_BUF223     (0x0E3)
#define	SENTENCE_BUF224     (0x0E4)
#define	SENTENCE_BUF225     (0x0E5)
#define	SENTENCE_BUF226     (0x0E6)
#define	SENTENCE_BUF227     (0x0E7)
#define	SENTENCE_BUF228     (0x0E8)
#define	SENTENCE_BUF229     (0x0E9)
#define	SENTENCE_BUF230     (0x0EA)
#define	SENTENCE_BUF231     (0x0EB)
#define	SENTENCE_BUF232     (0x0EC)
#define	SENTENCE_BUF233     (0x0ED)
#define	SENTENCE_BUF234     (0x0EE)
#define	SENTENCE_BUF235     (0x0EF)
#define	SENTENCE_BUF236     (0x0F0)
#define	SENTENCE_BUF237     (0x0F1)
#define	SENTENCE_BUF238     (0x0F2)
#define	SENTENCE_BUF239     (0x0F3)
#define	SENTENCE_BUF240     (0x0F4)
#define	SENTENCE_BUF241     (0x0F5)
#define	SENTENCE_BUF242     (0x0F6)
#define	SENTENCE_BUF243     (0x0F7)
#define	SENTENCE_BUF244     (0x0F8)
#define	SENTENCE_BUF245     (0x0F9)
#define	SENTENCE_BUF246     (0x0FA)
#define	SENTENCE_BUF247     (0x0FB)
#define	SENTENCE_BUF248     (0x0FC)
#define	SENTENCE_BUF249     (0x0FD)
#define	SENTENCE_BUF250     (0x0FE)
#define	SENTENCE_BUF251     (0x0FF)
#define	SENTENCE_BUF252     (0x100)
#define	SENTENCE_BUF253     (0x101)
#define	SENTENCE_BUF254     (0x102)
#define	SENTENCE_BUF255     (0x103)

#define KEYTEST_AD1_ADDR2_OFFSET (0x18)

#endif

